[33mtag v1.0[m
Tagger: liulei <2845611677@qq.com>
Date:   Sun Feb 28 17:35:11 2021 +0800

'1.0版本'

[33mcommit 8a817a802e98453f6433e1305825e604d9ef8272[m[33m ([m[1;36mHEAD -> [m[1;32mmaster[m[33m, [m[1;33mtag: v1.0[m[33m)[m
Author: liulei <2845611677@qq.com>
Date:   Sun Feb 28 12:28:21 2021 +0800

    'add'

[1mdiff --git a/QQ浏览器截图20210115200146.png b/QQ浏览器截图20210115200146.png[m
[1mnew file mode 100644[m
[1mindex 0000000..bcdfa49[m
Binary files /dev/null and b/QQ浏览器截图20210115200146.png differ
[1mdiff --git a/jupyter.docx b/jupyter.docx[m
[1mnew file mode 100644[m
[1mindex 0000000..773223b[m
[1m--- /dev/null[m
[1m+++ b/jupyter.docx[m
[36m@@ -0,0 +1,26 @@[m
[32m+[m[32mEsc：退出插入模式（青蓝色）[m
[32m+[m[32mEnter:进入插入模式（绿色）[m
[32m+[m[32mCtrl+z:返回上一步[m
[32m+[m[32m复制,粘贴啥的就过了[m
[32m+[m[32m---------------------------------------------------非插入模式下:[m
[32m+[m[32mA:在上面插入一行[m
[32m+[m[32mB:在上面插入一行[m
[32m+[m[32m1(主键盘)：在Esc模式下，启用一级标题[m
[32m+[m[32m2(主键盘)：在Esc模式下，启用二级标题[m
[32m+[m[32m3(主键盘)：在Esc模式下，启用三级标题[m
[32m+[m[32mM:将其变成markdown模式[m
[32m+[m[32mY:将其变成代码模式[m
[32m+[m[32mR:将其变为原生NBC模式[m
[32m+[m[32m  DD:删除光标所在的行[m
[32m+[m[32m  F:全局查找及替换[m
[32m+[m
[32m+[m[32m---------------------------------------------------[m
[32m+[m[32mCtrl+enter: 运行代码[m
[32m+[m[32mshift+enter：运行代码并且选中下行的代码(如果下行没有代码就新创建空白的一行)[m
[32m+[m[32malt+enter:运行代码,并在下面新建一行[m
[32m+[m[32mShift：需要大写字符时，按住shfit+相对应的字符[m
[32m+[m[32m例：A= Shift+a   B= Shift+b[m[41m [m
[32m+[m[32mCtrl+/ :注释该行[m[41m [m
[32m+[m
[32m+[m
[32m+[m
[1mdiff --git a/linux命令.txt b/linux命令.txt[m
[1mnew file mode 100644[m
[1mindex 0000000..d42f314[m
[1m--- /dev/null[m
[1m+++ b/linux命令.txt[m
[36m@@ -0,0 +1,3 @@[m
[32m+[m[32m 1480sudo find /home/tarena/ -name pycharm[m
[32m+[m[32m 1481  tar -zvxf pycharm-professional-2019.3.3.tar.gz[m[41m [m
[32m+[m[32m 1498  ./pycharm.sh[m
\ No newline at end of file[m
[1mdiff --git a/战争学院.xlsx b/战争学院.xlsx[m
[1mnew file mode 100644[m
[1mindex 0000000..1424c11[m
Binary files /dev/null and b/战争学院.xlsx differ
